# Challenge Questions - TfL Dataset

# Instructions:
• Please ensure you don't overwrite any existing cells. Add new cells below by pressing ALT+ENTER

• Attempt all of the questions

• You are encouraged to look online for help should you need it

# Dataset overview:
There are three datasets stored in the same directory as this Notebook, they are all related to each other:

• **tfl-daily-cycle-hires.csv**: This dataset contains bike hire data from Transport for London during the period 
30th July 2010 to 30th September 2021. 'Day' is the day in '%d/%m/%Y' format. 'Number of Bicycle Hires' is the total number of bikes hired that day.

#

## Import pandas, numpy and datetime

In [104]:
import pandas as pd
import datetime as dt
import numpy as np

## Load the files:
• "tfl-daily-cycle-hires.csv" should be assigned to the variable **tfl**

In [106]:
tfl=pd.read_csv('tfl-daily-cycle-hires.csv')

In [107]:
tfl.dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

## Check the head of the DataFrame

In [109]:
tfl.head()

          Day  Number of Bicycle Hires  Unnamed: 2
0  30/07/2010                   6897.0         NaN
1  31/07/2010                   5564.0         NaN
2  01/08/2010                   4303.0         NaN
3  02/08/2010                   6642.0         NaN
4  03/08/2010                   7966.0         NaN

In [110]:
tfl.tail()

             Day  Number of Bicycle Hires  Unnamed: 2
4076  26/09/2021                  45120.0         NaN
4077  27/09/2021                  32167.0         NaN
4078  28/09/2021                  32539.0         NaN
4079  29/09/2021                  39889.0         NaN
4080  30/09/2021                  34070.0         NaN

## Check the data types of the DataFrame columns

In [112]:
tfl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4081 entries, 0 to 4080
Data columns (total 3 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Day                      4081 non-null   object
 1   Number of Bicycle Hires  4081 non-null   float64
 2   Unnamed: 2               0 non-null      float64
dtypes: float64(2), object(1)
memory usage: 95.8+ KB

In [113]:
tfl.dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

## Change the data types and remove unnecessary columns 

• 'Day' should be a datetime64 data type

• 'Number of Bicycle Hires' should be float64

• Any other columns should be deleted

In [115]:
tfl['Day']=tfl['Day'].astype('datetime64[ns]')

In [116]:
tfl['Day']

0      2010-07-30
1      2010-07-31
2      2010-01-08
3      2010-02-08
4      2010-03-08
          ...
4076   2021-09-26
4077   2021-09-27
4078   2021-09-28
4079   2021-09-29
4080   2021-09-30
Name: Day, Length: 4081, dtype: datetime64[ns]

In [117]:
tfl['Day']=pd.to_datetime(tfl['Day'],format='%d/%m/%Y')

In [118]:
tfl.drop(columns='Unnamed: 2',inplace=True)

In [119]:
tfl

            Day  Number of Bicycle Hires
0    2010-07-30                   6897.0
1    2010-07-31                   5564.0
2    2010-01-08                   4303.0
3    2010-02-08                   6642.0
4    2010-03-08                   7966.0
...         ...                      ...
4076 2021-09-26                  45120.0
4077 2021-09-27                  32167.0
4078 2021-09-28                  32539.0
4079 2021-09-29                  39889.0
4080 2021-09-30                  34070.0

[4081 rows x 2 columns]

In [120]:
round(tfl['Number of Bicycle Hires'],2)

0        6897.0
1        5564.0
2        4303.0
3        6642.0
4        7966.0
         ...
4076    45120.0
4077    32167.0
4078    32539.0
4079    39889.0
4080    34070.0
Name: Number of Bicycle Hires, Length: 4081, dtype: float64

## What is the average number of bicycle hires per day across the entire dataset?

In [122]:
tfl['Number of Bicycle Hires'].mean()

26261.932124479295

## Create a new column called 'Year' which contains the 4 digit year

In [124]:
tfl['Day'] = pd.to_datetime(tfl['Day']) 
tfl['Year'] = tfl['Day'].dt.year
#OR
tfl['Year']=tfl['Day'].dt.strftime('%Y')
tfl['Year'] = tfl['Year'].astype(int)

In [125]:
tfl

            Day  Number of Bicycle Hires  Year
0    2010-07-30                   6897.0  2010
1    2010-07-31                   5564.0  2010
2    2010-01-08                   4303.0  2010
3    2010-02-08                   6642.0  2010
4    2010-03-08                   7966.0  2010
...         ...                      ...   ...
4076 2021-09-26                  45120.0  2021
4077 2021-09-27                  32167.0  2021
4078 2021-09-28                  32539.0  2021
4079 2021-09-29                  39889.0  2021
4080 2021-09-30                  34070.0  2021

[4081 rows x 3 columns]

In [126]:
tfl.dtypes

Day                        datetime64[ns]
Number of Bicycle Hires           float64
Year                                int32
dtype: object

## What is the total number of bicycle hires per Year across the entire dataset

In [129]:
tfl.pivot_table(index='Year',aggfunc='sum',values='Number of Bicycle Hires')
# or
# tfl.groupby(by='Year').mean()

      Number of Bicycle Hires
Year
2010                2180813.0
2011                7142449.0
2012                9519283.0
2013                8045459.0
2014               10023897.0
2015                9871839.0
2016               10303637.0
2017               10446044.0
2018               10567540.0
2019               10424955.0
2020               10434167.0
2021                8214862.0

## Create a new column called 'Category' on the tfl DataFrame that classifies the number of bike hires per day as:
* 'Low' if the 'Number of Bicycle Hires' is below 10,000
* 'Medium' if the 'Number of Bicycle Hires' is below 40,000 but greater than or equal to 10,000
* 'High' if the 'Number of Bicycle Hires' is greater than or equal to 40,000

In [131]:
def category_class(x):
    if x<10000:
        return 'Low'
    elif x<40000:
        return'Medium'
    elif x>=40000:
        return 'High'

In [132]:
category_class(90000)

'High'

In [133]:
tfl

            Day  Number of Bicycle Hires  Year
0    2010-07-30                   6897.0  2010
1    2010-07-31                   5564.0  2010
2    2010-01-08                   4303.0  2010
3    2010-02-08                   6642.0  2010
4    2010-03-08                   7966.0  2010
...         ...                      ...   ...
4076 2021-09-26                  45120.0  2021
4077 2021-09-27                  32167.0  2021
4078 2021-09-28                  32539.0  2021
4079 2021-09-29                  39889.0  2021
4080 2021-09-30                  34070.0  2021

[4081 rows x 3 columns]

In [134]:
def category_class(x):
    if x < 10000:
        return 'Low'
    elif x < 40000:
        return 'Medium'
    else:
        return 'High'

tfl['category'] = tfl['Number of Bicycle Hires'].apply(category_class)
tfl['category'].astype('string')

0          Low
1          Low
2          Low
3          Low
4          Low
         ...
4076      High
4077    Medium
4078    Medium
4079    Medium
4080    Medium
Name: category, Length: 4081, dtype: string

In [135]:
tfl

            Day  Number of Bicycle Hires  Year category
0    2010-07-30                   6897.0  2010      Low
1    2010-07-31                   5564.0  2010      Low
2    2010-01-08                   4303.0  2010      Low
3    2010-02-08                   6642.0  2010      Low
4    2010-03-08                   7966.0  2010      Low
...         ...                      ...   ...      ...
4076 2021-09-26                  45120.0  2021     High
4077 2021-09-27                  32167.0  2021   Medium
4078 2021-09-28                  32539.0  2021   Medium
4079 2021-09-29                  39889.0  2021   Medium
4080 2021-09-30                  34070.0  2021   Medium

[4081 rows x 4 columns]

## For each year in the tfl DataFrame how many days are classed as 'Low', 'Medium' or 'High'?

In [137]:
category_counts=tfl.groupby(by=['Year','category']).count()

In [138]:
category_counts

               Day  Number of Bicycle Hires
Year category
2010 Low        44                       44
     Medium    111                      111
2011 Low        30                       30
     Medium    335                      335
2012 High       27                       27
     Low        19                       19
     Medium    320                      320
2013 Low        25                       25
     Medium    340                      340
2014 High       27                       27
     Low        10                       10
     Medium    328                      328
2015 High       12                       12
     Low         9                        9
     Medium    344                      344
2016 High       37                       37
     Low         6                        6
     Medium    323                      323
2017 High       28                       28
     Low        13                       13
     Medium    324                      324
2018 High       52                       52
     Low        16                       16
     Medium    297                      297
2019 High       20                       20
     Low         3                        3
     Medium    342                      342
2020 High       63                       63
     Low        11                       11
     Medium    292                      292
2021 High       62                       62
     Low         9                        9
     Medium    202                      202

In [181]:
tfl.pivot_table(columns='category',index='Year',aggfunc='count',fill_value=0,values='Day')

category  High  Low  Medium
Year
2010         0   44     111
2011         0   30     335
2012        27   19     320
2013         0   25     340
2014        27   10     328
2015        12    9     344
2016        37    6     323
2017        28   13     324
2018        52   16     297
2019        20    3     342
2020        63   11     292
2021        62    9     202